import { faker } from '@faker-js/faker';

// ----------------------------------------------------------------------

const POST_TITLES = [
  'Революционный дизайн улья увеличивает производство меда на 30%!',
  'Топ-10 органических средств для поддержания здоровья и счастья пчел',
  'Пчеловодство для начинающих: советы для тех, кто заводит свой первый улей',
  'Местные пчеловоды объединяются для спасения исчезающих видов пчел',
  'Инновационные методы городского пчеловодства для жителей городов',
  'Как изменение климата влияет на поведение пчел и производство меда',
  'Встречайте победителей Национального фестиваля сбора меда 2024 года',
  'Последние тенденции в устойчивом пчеловодстве: что вам нужно знать',
  'Секреты успешной зимовки пчел от экспертов',
  'Откройте для себя самые редкие меда мира и места их добычи',
  'Внимание на общество: наградной проект молодого пчеловода по здоровью колоний',
  'Сделай сам: декор ульев - воплотите свои творческие идеи',
  'Влияние пестицидов на пчел: что вы можете сделать, чтобы помочь',
  'Сад, дружественный к пчелам: лучшие растения для окружения ваших ульев',
  'На мировой конференции по пчеловодству представлены прорывные исследования',
  'Эксклюзивное интервью с автором книги "Пчелы и устойчивость: новая эра"',
  'Как успешно расширить ваш бизнес по пчеловодству в 2024 году',
  'Практические советы по борьбе с вредителями и болезнями ульев',
  'За кулисами: день из жизни коммерческого пчеловода',
  'Конкурс фотографий: лучшие снимки пчел и цветов от нашего сообщества',
];

export const posts = [...Array(19)].map((_, index) => ({
  id: faker.string.uuid(),
  cover: `/assets/images/covers/cover_${index + 1}.jpg`,
  title: POST_TITLES[index + 1],
  createdAt: faker.date.past(),
  view: faker.number.int(99999),
  comment: faker.number.int(99999),
  share: faker.number.int(99999),
  favorite: faker.number.int(99999),
  author: {
    name: faker.person.fullName(),
    avatarUrl: `/assets/images/avatars/avatar_${index + 1}.jpg`,
  },
}));
